{"pageProps":{"postData":{"id":"uk-box-office-data-rebuilt","contentHtml":"<p><img src=\"/assets/images/uk-box-office/1.png\" alt=\"image\"></p>\n<p>About two years ago, I launched the <a href=\"/posts/uk-box-office\">UK Box Office</a> dashboard. It was a simple web app that I built to track the box office figures for UK films.</p>\n<blockquote>\n<p><em>The new UK Box Office dashboard is the only place you can find box office data this easily.</em></p>\n</blockquote>\n<blockquote>\n<p><em>Box office is the one metric that counts in cinema - despite hype, critics, and marketing; audiences are always the great leveller. I check the latest numbers every week, but unfortunately this still means comparing excel sheets to see what's going on. So I finally got round to spending a weekend making it much easier, and more fun.</em></p>\n</blockquote>\n<p>This was a few weeks before COVID-19 shut down cinemas in the UK, and rendered it pretty much useless.</p>\n<p>Downtime during the pandemic did give me room to rebuild it from scratch.</p>\n<p>It's now live at <a href=\"https://boxofficedata.co.uk\">boxofficedata.co.uk</a></p>\n<p><img src=\"/assets/images/uk-box-office/gif.gif\" alt=\"image\"></p>\n<ul>\n<li>It's much much faster, loading the last year of data in under a second.</li>\n<li>You can link directly to films, distributors, and time periods.</li>\n<li>Full featured search.</li>\n<li>Export data to CSV, JSON, and Excel.</li>\n<li>Ability to create reports, for example the <a href=\"https://boxofficedata.co.uk/reports/distributor-market-share\">Distributor Market Share</a>.</li>\n<li>Experiment with other ideas, like <a href=\"https://boxofficedata.co.uk/reports/forecast\">forecasting</a> and comparisons.</li>\n<li>Public API for external use.</li>\n</ul>\n<p><img src=\"/assets/images/uk-box-office/3.png\" alt=\"image\"></p>\n<p>Overall, it's much more inline with tools like Box Office Mojo, and The Numbers. Except in £, and with data with no gaps, right back to 2001.\nMuch more inline with box office mojo, and The Numbers. In £, and much more data.</p>\n<p>You can read a technical write-up of how it works <a href=\"/posts/uk-box-office-data-studio-to-flask\">over here</a>.</p>\n","title":"Rebuilding UK Box Office","date":"2022-05-05","image":"/assets/images/uk-box-office/1.png","tag":"projects","permalink":"uk-box-office-data-rebuilt"}},"__N_SSG":true}