{"pageProps":{"postData":{"id":"broadway-dashboard","contentHtml":"<p><img src=\"/assets/images/broadway/broadway-1.png\" alt=\"image\"></p>\n<p>Broadway is nationally recognised as the cultural leader for independent cinema, arts, and technology in the Midlands, and is the lead organisation for <a href=\"/posts/film-hub-midlands-dashboard\">Film Hub Midlands</a>.</p>\n<p>I built this dashboard to unify business data from across the organisation, using Python for the data pipeline and Google Data Studio for visualisation.</p>\n<p>I believe that dashboards are the best way to:</p>\n<ul>\n<li>Create and share intelligence across an organisation.</li>\n<li>Remove gatekeepers, and increase safe access to data.</li>\n<li>Increase efficiency, and data confidence within teams.</li>\n</ul>\n<p>The data pipeline automatically imports from Vista box office system PDF files, this code can be found as part of the <a href=\"/posts/auspex-box-office-pipeline\">Auspex</a> data pipeline, which essentially extends it for use with machine learning. Additionally, e-commerce data from Google Analytics is extracted for each film.</p>\n<hr>\n<p><img src=\"/assets/images/broadway/broadway-2.png\" alt=\"image\"></p>\n<p>The dashboard equips you with a comprehensive overview of business data, from box office to bar, concessions (popcorn), physical, and online sales.\nThis data set stretches back to 1992, with over 450 films and 200,000 admissions a year. And could comfortably scale for far beyond this.</p>\n<hr>\n<p><img src=\"/assets/images/broadway/broadway-3.png\" alt=\"image\"></p>\n<p>For the box office - you can breakdown further by filtering by film, reflecting on the split between physical and digital sales. This filtering is very powerful, with the ability to drill down by date, screen, week run, distributor, and more.\nSimilar product breakdown is available with the cafe bar and concessions data.</p>\n<hr>\n<p><img src=\"/assets/images/broadway/broadway-4.png\" alt=\"image\"></p>\n<p>The digital page takes the best from Google Analytics, for an easy way to understand how your digital platforms are performing. Also operating as a campaign dashboard, attributing every ticket sale to a campaign or channel, with campaign cost, revenue, and conversions all clear to see - a clear way of showing your return on investment.</p>\n<hr>\n<p><img src=\"/assets/images/broadway/broadway-5.png\" alt=\"image\"></p>\n<p>You can even explore audience demographic data, showing growth of audience segments over time.</p>\n<hr>\n<p>The power of using Google Data Studio is that everyone in the organisation can easily use it, without worrying about spreadsheets or databases. Reports can be scheduled and easily shared, and even exported back to where it all started, PDF files.</p>\n<p>Ultimately the aim is to aid decision making both on a strategic planning level, and in tactical delivery. For a cinema to continue to prosper, they have to adapt to becoming a modern organisation that uses software to find an edge. Cinemas <a href=\"https://www.satellitetoday.com/innovation/2019/02/26/microsoft-ceo-every-company-is-now-a-software-company/\">have to become a software companies</a>.</p>\n<hr>\n<p><em>Note - the images on this page show sample data, and are not reflective of Broadway.</em></p>\n","title":"Broadway Cinema Dashboard","date":"2020-07-10","image":"/assets/images/broadway/broadway-1.png","tag":"projects","permalink":"broadway-dashboard"}},"__N_SSG":true}