{"pageProps":{"postData":{"id":"uk-box-office-data-studio-to-flask","contentHtml":"<p><img src=\"/assets/images/uk-box-office/1.png\" alt=\"image\"></p>\n<p>About two years ago, I launched the <a href=\"/posts/uk-box-office\">UK Box Office</a> dashboard. It was a simple web app that I built to track the box office figures for UK films.</p>\n<blockquote>\n<p><em>The new UK Box Office dashboard is the only place you can find box office data this easily.</em></p>\n</blockquote>\n<blockquote>\n<p><em>Box office is the one metric that counts in cinema - despite hype, critics, and marketing; audiences are always the great leveller. I check the latest numbers every week, but unfortunately this still means comparing excel sheets to see what's going on. So I finally got round to spending a weekend making it much easier, and more fun.</em></p>\n</blockquote>\n<p>Downtime during the pandemic did give me room to rebuild it from scratch.</p>\n<p>It's now live at <a href=\"https://boxofficedata.co.uk\">boxofficedata.co.uk</a></p>\n<p><img src=\"/assets/images/uk-box-office/gif.gif\" alt=\"image\"></p>\n<p>You can read a write-up of what's changed <a href=\"/posts/uk-box-office-data-rebuilt\">over here</a>.</p>\n<p>On the technical side, it's changed completely.</p>\n<p>Previously it was just a BigQuery database, with Google Data Studio running as a front end, and a local Python ETL pipeline to move the data - this has it's limitations.</p>\n<p>Primarily it's so slow - GDS slows right down with anymore than a few thousand rows, and with 20 years of box office data, it was loading in 5 - 7 seconds for every query.</p>\n<p>I rebuilt it completly; using Flask, PostgreSQL, Elasticsearch, and VueJS. It runs simply in across a few containers deployed on Google Cloud.</p>\n<p>It's now so fast, and much more fully featured than using Google Data Studio.</p>\n<p>It pretty much runs itself now, using APScheduler to fetch the new data every week, and even uses Prophet to forecast the next few months box office figures. Which is pretty uncertain right now - but something for another post.</p>\n<p>The code is available on <a href=\"https://github.com/AndyRae/uk-box-office\">Github</a>.</p>\n","title":"UK Box Office from Google Data Studio to Flask","date":"2022-05-05","image":"/assets/images/uk-box-office/3.png","tag":"projects","permalink":"uk-box-office-data-studio-to-flask"}},"__N_SSG":true}