{"pageProps":{"postData":{"id":"launching-film-research","contentHtml":"<p>The UK film industry produces an incredible amount of resources every year. But also sees an incredible amount lost and forgotten, we’re trying to fix that.</p>\n<p><a href=\"https://filmresearch.org\">Film Research</a> is a library of film research, reports, and data sets.</p>\n<p>We’ve indexed hundreds of resources to support innovation in the UK film industry.</p>\n<p><img src=\"/assets/images/projects/fr-1.png\" alt=\"website\"></p>\n<p>Our aim is to:</p>\n<ul>\n<li>Archive and index film industry research, resources, and data sets.</li>\n<li>Increase access and availability to these resources.</li>\n<li>Help cultivate an intelligent and thriving UK film industry.</li>\n</ul>\n<p>We believe that making these resources easily available leads to an open and intelligent industry – we’re trying to share best practice, prevent duplication, and promote transparency and accountability.</p>\n<p>We’re going to continue to add resources, both from the past and as new ones are found. We’re also working on making these resources easier to discover and contextualise.</p>\n<p>But our big ambition is for this project to become a collaboration. Currently the “we”, is just me, Andy. None of these resources belong to me, and I’ve been making this library itself open source in the hope of finding contributors.</p>\n<p>You can find all of the <a href=\"https://github.com/AndyRae/filmresearch-list\">resources on GitHub</a>, so you can already contribute by creating a branch and pull request.</p>\n<p>I’m exploring different platforms to encourage this kind of collaboration, and ultimately aiming for a Git-powered wiki. You can follow progress on that <a href=\"https://github.com/AndyRae/grav-filmresearch\">over here</a>, I’m working towards a launch of this version this Spring.</p>\n","title":"Launching FilmResearch.org Beta","date":"2018-03-27","image":"/assets/images/projects/fr-1.png","tag":"projects"}},"__N_SSG":true}