{"pageProps":{"postData":{"id":"uk-box-office","contentHtml":"<p><img src=\"/assets/images/projects/uk-box-office.png\" alt=\"image1\"></p>\n<p>The new UK Box Office dashboard is the only place you can find box office data this easily.</p>\n<p>Box office is the one metric that counts in cinema - despite hype, critics, and marketing; audiences are always the great leveller. I check the latest numbers every week, but unfortunately this <em>still</em> means comparing excel sheets to see what's going on. So I finally got round to spending a weekend making it much easier, and more fun.</p>\n<p><a href=\"https://boxofficedata.co.uk\">boxoffice.rae.li</a></p>\n<p>If you want to find out how <em>Parasite</em> is doing this month, you don’t have to open the last four weeks excel files, or wait for Screen to report it.</p>\n<p>And if you want to find out how <em>Slumdog Millionaire</em> did on week 11 back in 2009 (grossed £876k from 384 sites, £416k of which was over the weekend) you don’t have to dig out that excel file either.\nBoth are just seconds away.</p>\n<p>The data pipeline is straightforward - extracting box office data from the <a href=\"https://www.bfi.org.uk/education-research/film-industry-statistics-research/weekend-box-office-figures\">source</a>, transforming and cleaning whilst adding a few metrics, then loading it into BigQuery.\nBigQuery takes care of serving the data to Data Studio, where there’s a reasonable speed improvement over just using a Google Sheet, but not as much as I’d hoped.</p>\n<p>There are inevitably errors, as the entire data set (years 2001 - 2020) is 40,000+ rows, a lot of which was clearly entered by hand. So distributor names are cleaned up for consistency, and obvious box office errors corrected.</p>\n<p>The source code is available on <a href=\"https://github.com/AndyRae/uk-box-office\">GitHub</a>, the site is also hosted on GitHub Pages.</p>\n","title":"UK Box Office Dashboard","date":"2020-03-02","image":"/assets/images/projects/uk-box-office.png","tag":"projects","permalink":"uk-box-office-dashboard"}},"__N_SSG":true}